{

'What is cyber crime?':'Any criminal activity that uses a computer either as instrumentality, target or a means for perpetuating further crimes comes within the ambit of cyber crime. The term “cyber-crime” is not defined under the Information Technology Act, 2000.In simple terms cyber crime would be “unlawful acts wherein the computer is either a tool or a target or both”. It is also known as computer crime, e-crime and electronic crime.',



'What are the various modes or manners of committing Cybercrime?':'There are various modes or methods by which cyber crime can be committed such as

Unauthorized access to computer systems or networks / Hacking
Theft of information contained in electronic form
Email bombing
Data diddling
Salami attack
Denial of Service attack
Virus / worm attacks
Logic bombs
Internet time thefts',



'What are the various types of cyber crimes?':'Cyber crimes can be classified into 3 major categories such as

a) Crime against government such as cyber terrorism.

b) Crime against persons such as cyber pornography, cyber stalking, cyber defamation

c) Crime against property such as online gambling, intellectual property infringement, phishing, credit card frauds.',



'What is an I.P address?':'The word I.P stands for Internet Protocol Address. It is a unique number consisting of four parts separated by dots, e.g. 151.164.1.6. Every machine that is on the Internet has a unique IP number, if a machine does not have an IP number; it is not really on the Internet. The IP address is just like any telephone number which identifies a particular computer on the Internet.',



'What is an IP spoofing?':'A technique used to gain unauthorized access to computers, whereby the intruder sends messages to a computer with an IP address indicating that the message is coming from a trusted host. To engage in IP spoofing, a hacker must first use a variety of techniques to find an IP address of a trusted host and then modify the packet headers so that it appears that the packets are coming from that host.',



'What do you mean by phishing?':'Phishing is the criminal and fraudulent act of attempting to acquire sensitive information such as usernames, password and credit card details by masquerading as a trustworthy entity or person in an electronic communication. Communications purporting to be from popular social web sites, auction sites, online payment processors or IT administrators are commonly used to lure the unsuspecting public. Phishing is typically carried out by e-mail or instant messaging and it often directs users to enter details at a fake website whose look and feel almost identical to the legitimate one.',



'What is a domain name?':'Since it is not possible to remember each and every numerical value of an IP address, the system of domain names evolved. Domain names are the alphabetic names used to refer to computers on the Internet. A web site address, including a suffix such as .com, .org, .gov or .edu comprises a domain name. The suffix indicates what type of organization is hosting the site. The dominant purpose of the domain name is simply to provide an easy method for remembering another’s electronic address.',



'What are the laws concerning Cybercrimes in India?':'Cyber crime can involve criminal activities that are traditional in nature, such as theft, fraud, forgery, defamation and mischief, all of which are subject to the Indian Penal Code. The abuse of computers has also given birth to a gamut of new age crimes that are addressed by the Information Technology Act, 2000. The Act does not define ‘cyber crime’. However, any activities which basically offend human sensibilities would come within its ambit.',



'How to report a Cyber crime?':'You need to provide the following possible information, along with an application letter addressing the head of cyber crime investigation cell when filing a complaint:

• Your name,
• Your mailing address,
• Your telephone number,
• Specific details on how the offence was committed, along with the names and addresses of suspects and any other relevant information necessary.

In case of an emergency you can directly contact your local police station.',



'Is Cyber harassment also a Cybercrime?':'Yes, it is a distinct Cybercrime. Various kinds of harassment can and does occur in cyberspace, or through the use of cyberspace. Harassment can be sexual, racial, religious, or other. Persons perpetuating such harassment are also guilty of Cybercrime.',



'What is cyber defamation?':'This occurs when defamation takes place with the help of computers and / or the Internet. E.g. someone publishes defamatory matter about someone on a website or sends e-mails containing defamatory information.',



'What is web-jacking?':'This term is derived from the term hi jacking. In these kinds of offences the hacker gains access and control over the web site of another. He may even change the information on the site. This may be done for fulfilling political objectives or for money. E.g. recently the site of MIT (Ministry of Information Technology) was hacked by the Pakistani hackers and some obscene matter was placed therein. Further the site of Bombay crime branch was also web jacked. Another case of web jacking is that of the ‘gold fish’ case. In this case the site was hacked and the information pertaining to gold fish was changed.',



'Is hacking a Cybercrime?':'Hacking is amongst the gravest Cybercrimes known till date. In simple terms it means an illegal intrusion into a computer system and/or network. Every act committed towards breaking into a computer and/or network is hacking. Some hackers hack for personal monetary gains, such as to stealing the credit card information, transferring money from various bank accounts to their own account followed by withdrawal of money. The offence is punishable under Section 66 of the IT Act,2000.',



'What is bandwidth?':'It is the measure of how much information one can send through a connection. It is usually measured in bits-per-second.',



'What is financial crime and what are the modes of committing such crime?':'Financial Crimes are defined as a crime against property, involving the unlawful conversion of the ownership of property (belonging to one person) to one’s own personal use and benefit.
There are many different ways that these crimes can be committed, for instance by mail, fax, telephone and the Internet. By using social engineering techniques or sophisticated technical methods such as “phishing”, fraudsters are able to plunder bank accounts across the world. Victims range from individuals to institutions, corporations, governments, and entire economies.',



'What is DNS SPOOFING?':'DNS Spoofing is a term used to describe the faking of host masks during the resolution of internet hosts names. To perform DNS spoofing a hacker attempts to intercept the communication and send fake host name mapping to the victims computer. This can be done using malicious web applets downloaded by the attacked user himself.',



'What are Virus and other Malicious Programs and Webware?':'Virus-Malicious programs intend to cause harm to targeted systems and include virus, worms, Trojan horses, Logic bombs and hoaxes.A virus is a program that infects an

executable file and after infecting it causes the file to function in an unusual way. It propagates itself by attaching to executable files like application programs and operating system. Running the executable file may make new copies of the virus. On the other hand there are programs that can copy itself called worms which don’t alter or delete any file but only multiply itself and send the copy to other computers from the victim’s computer.',




'What is a Trojan Horse ?':'A destructive program that masquerades as a benign application. Unlike viruses,
Trojan horses do not replicate themselves but they can be just as destructive. One of the most insidious types of Trojan horse is a program that claims to rid your computer of viruses but instead introduces viruses onto your computer. The term comes from the a Greek story of the Trojan War, in which the Greeks give a giant wooden horse to their foes, the Trojans, ostensibly as a peace offering. But after the Trojans drag the horse inside their city walls, Greek soldiers sneak out of the horse’s hollow belly and open the city gates, allowing their compatriots to pour in and capture Troy. Trojan horses are broken down in classification based on how they breach systems and the damage they cause.',



'What is Cyberstalking?':'Cyberstalking, which is simply an extension of the physical form of stalking, is where the electronic mediums such as the Internet are used to pursue, harass or contact another in an unsolicited fashion. Most often, given the vast distances that the Internet spans, this behaviour will never manifest itself in the physical sense but this does not mean that the pursuit is any less distressing. There are a wide variety of means by which individuals may seek out and harass individuals even though they may not share the same geographic borders, and this may present a range of physical, emotional, and psychological consequences to the victim. In one such instance, Seema an employee with an embassy in New Delhi was harassed by a cyber stalker who used criminal blackmail and intimidation and demanded Rupees 1 lakh from her. This man threatened Seema that he would put her morphed pictures on obscene websites along with her phone number and address. The Protection from Harassment Act, 1997 of UK and Model Anti-stalking Code by the National Institute of Justice, USA for adoption by its states are examples of initiatives to combat the problem of cyber stalking.',



'What is Cyber Terrorism?':'Cyber Terrorism denotes unlawful attacks and threats of attack against computers, network and information stored therein to intimidate or coerce a government or its people for propagating hidden political or unlawful social and religious motives. These attacks could result in violence against persons or property or cause public unrest. Few examples could be explosions, plane crashes and severe economic losses. Terrorists are known to use internet to prepare schemes, raise funds and spread cyber terrorism. For instance Ramzi Yousef who was a key person behind World Trade Centre attack had detailed schemes to destroy United States airliners encrypted files in his laptop computer.',



'What is cybersecurity?':'Cybersecurity refers to the protection of hardware, software, and data from attackers. The primary purpose of cyber security is to protect against cyberattacks like accessing, changing, or destroying sensitive information.',



'What are the elements of cybersecurity?':'Major elements of cybersecurity are:

Information security
Network security
Operational security
Application security
End-user education
Business continuity planning',



'What are the advantages of cyber security?':'Benefits of cyber security are as follows:

It protects the business against ransomware, malware, social engineering, and phishing.
It protects end-users.
It gives good protection for both data as well as networks.
Increase recovery time after a breach.
Cybersecurity prevents unauthorized users.',



'Define Cryptography.':'It is a technique used to protect information from third parties called adversaries. Cryptography allows the sender and recipient of a message to read its details.',



'Differentiate between IDS and IPS.':'Intrusion Detection System (IDS) detects intrusions. The administrator has to be careful while preventing the intrusion. In the Intrusion Prevention System (IPS), the system finds the intrusion and prevent it.',



'What is CIA?':'Confidentiality, Integrity, and Availability (CIA) is a popular model which is designed to develop a security policy. CIA model consists of three concepts:

Confidentiality: Ensure the sensitive data is accessed only by an authorized user.
Integrity: Integrity means the information is in the right format.
Availability: Ensure the data and resources are available for users who need them.',



'What is a Firewall?':'It is a security system designed for the network. A firewall is set on the boundaries of any system or network which monitors and controls network traffic. Firewalls are mostly used to protect the system or network from malware, worms, and viruses. Firewalls can also prevent content filtering and remote access.',



'Explain Traceroute':'It is a tool that shows the packet path. It lists all the points that the packet passes through. Traceroute is used mostly when the packet does not reach the destination. Traceroute is used to check where the connection breaks or stops or to identify the failure.',



'Differentiate between HIDS and NIDS.':'
Parameter	HIDS	NIDS
Usage	HIDS is used to detect the intrusions.	NIDS is used for the network.
What does it do?	It monitors suspicious system activities and traffic of a specific device.	It monitors the traffic of all device on the network.',



'Explain SSL':'SSL stands for Secure Sockets Layer. It is a technology creating encrypted connections between a web server and a web browser. It is used to protect the information in online transactions and digital payments to maintain data privacy.',



'What do you mean by data leakage?':'Data leakage is an unauthorized transfer of data to the outside world. Data leakage occurs via email, optical media, laptops, and USB keys.',



'Explain the brute force attack. How to prevent it?':'It is a trial-and-error method to find out the right password or PIN. Hackers repetitively try all the combinations of credentials. In many cases, brute force attacks are automated where the software automatically works to login with credentials. There are ways to prevent Brute Force attacks. They are:

Setting password length.
Increase password complexity.
Set limit on login failures.',



'What is port scanning?':'It is the technique for identifying open ports and service available on a specific host. Hackers use port scanning technique to find information for malicious purposes.',



'Name the different layers of the OSI model.':'Seven different layers of OSI models are as follows: Physical Layer
Data Link Layer
Network Layer
Transport Layer
Session Layer
Presentation Layer
Application Layer',



'What is a VPN?':'VPN stands for Virtual Private Network. It is a network connection method for creating an encrypted and safe connection. This method protects data from interference, snooping, censorship.',



'What are black hat hackers?':'Black hat hackers are people who have a good knowledge of breaching network security. These hackers can generate malware for personal financial gain or other malicious reasons. They break into a secure network to modify, steal, or destroy data so that the network can not be used by authorized network users.',



'What are white hat hackers?':'White hat hackers or security specialist are specialized in penetration testing. They protect the information system of an organization.',



'What are grey hat hackers?':'Grey hat hackers are computer hacker who sometimes violate ethical standards, but they do not have malicious intent.',



'How to reset a password-protected BIOS configuration?':'There are various ways to reset BIOS password. Some of them are as follows:

Remove CMOS battery.
By utilizing the software.
By utilizing a motherboard jumper.
By utilizing MS-DOS.',



'What is MITM attack?':'A MITM or Man-in-the-Middle is a type of attack where an attacker intercepts communication between two persons. The main intention of MITM is to access confidential information.',



'Define ARP and its working process.':'It is a protocol used for finding MAC address associated with IPv4 address. This protocol work as an interface between the OSI network and OSI link layer.',



'Explain botnet.':'It’s a number of internet-connected devices like servers, mobile devices, IoT devices, and PCs that are infected and controlled by malware.',



'What is the main difference between SSL and TLS?':'The main difference between these two is that SSL verifies the identity of the sender. SSL helps you to track the person you are communicating to. TLS offers a secure channel between two clients.',



'What is the abbreviation of CSRF?':'CSRF stands for Cross-Site Request Forgery.',



'What is 2FA? How to implement it for a public website?':'TFA stands for Two Factor Authentication. It is a security process to identify the person who is accessing an online account. The user is granted access only after presenting evidence to the authentication device.',



'Explain the difference between asymmetric and symmetric encryption.':'Symmetric encryption requires the same key for encryption and decryption. On the other hand, asymmetric encryption needs different keys for encryption and decryption.',



'What is the full form of XSS?':'XSS stands for cross-site scripting.',



'Explain WAF':'WAF stands for Web Application Firewall. WAF is used to protect the application by filtering and monitoring incoming and outgoing traffic between web application and the internet.',



'What is hacking?':'Hacking is a process of finding weakness in computer or private networks to exploit its weaknesses and gain access.

For example, using password cracking technique to gain access to a system.',



'Who are hackers?':'A Hacker is a person who finds and exploits the weakness in computer systems, smartphones, tablets, or networks to gain access. Hackers are well experienced computer programmers with knowledge of computer security.',



'What is network sniffing?':'Network sniffing is a tool used for analyzing data packets sent over a network. This can be done by the specialized software program or hardware equipment. Sniffing can be used to:

Capture sensitive data such as password.
Eavesdrop on chat messages
Monitor data package over a network',



'What is the importance of DNS monitoring?':'Yong domains are easily infected with malicious software. You need to use DNS monitoring tools to identify malware.',



'Define the process of salting. What is the use of salting?':'Salting is that process to extend the length of passwords by using special characters. To use salting, it is very important to know the entire mechanism of salting. The use of salting is to safeguard passwords. It also prevents attackers testing known words across the system.

For example, Hash(“QxLUF1bgIAdeQX”) is added to each and every password to protect your password. It is called as salt.',



'What is SSH?':'SSH stands for Secure Socket Shell or Secure Shell. It is a utility suite that provides system administrators secure way to access the data on a network.',



'Is SSL protocol enough for network security?':'SSL verifies the sender’s identity, but it does not provide security once the data is transferred to the server. It is good to use server-side encryption and hashing to protect the server against a data breach.',



'What is black box testing and white box testing?':'Black box testing: It is a software testing method in which the internal structure or program code is hidden.
White box testing: A software testing method in which internal structure or program is known by tester.',



'Explain vulnerabilities in network security.':'Vulnerabilities refer to the weak point in software code which can be exploited by a threat actor. They are most commonly found in an application like SaaS (Software as a service) software.',



'Explain TCP Three-way handshake.':'It is a process used in a network to make a connection between a local host and server. This method requires the client and server to negotiate synchronization and acknowledgment packets before starting communication.',



'Define the term residual risk. What are three ways to deal with risk?':'It is a threat that balances risk exposure after finding and eliminating threats.

Three ways to deal with risk are:

Reduce it
Avoid it
Accept it.',



'Define Exfiltration.':'Data exfiltration refers to the unauthorized transfer of data from a computer system. This transmission may be manual and carried out by anyone having physical access to a computer.',



'What is exploit in network security?':'An exploit is a method utilized by hackers to access data in an unauthorized way. It is incorporated into malware.',



'What do you mean by penetration testing?':'It is the process of checking exploitable vulnerabilities on the target. In web security, it is used to augment the web application firewall.',



'List out some of the common cyber-attack.':'Following are the common cyber-attacks which can be used by hackers to damage network:

Malware
Phishing
Password attacks
DDoS
Man in the middle
Drive-by downloads
Malvertising
Rogue software',



'How to make the user authentication process more secure?':'In order to authenticate users, they have to provide their identity. The ID and Key can be used to confirm the user’s identity. This is an ideal way how the system should authorize the user.',



'Explain the concept of cross-site scripting.':'Cross-site scripting refers to a network security vulnerability in which malicious scripts are injected into websites. This attack occurs when attackers allow an untrusted source to inject code into a web application.',



'Name the protocol that broadcast the information across all the devices.':'Internet Group Management Protocol or IGMP is a communication protocol that is used in game or video streaming. It facilitates routers and other communication devices to send packets.',



'How to protect email messages?':'Use cipher algorithm to protect email, credit card information, and corporate data.',



'What are the risks associated with public Wi-Fi?':'Public Wi-Fi has many security issues. Wi-Fi attacks include karma attack, sniffing, war-driving, brute force attack, etc.

Public Wi-Fi may identify data that is passed through a network device like emails, browsing history, passwords, and credit card data.',



'What is Data Encryption? Why it is important in network security?':'Data encryption is a technique in which the sender converts the message into a code. It allows only authorized user to gain access.',



'Explain the main difference between Diffie-Hellman and RSA.':'Diffie-Hellman is a protocol used while exchanging key between two parties while RSA is an algorithm that works on the basis two keys called private and public key.',



'What is a remote desktop protocol?':'Remote Desktop Protocol (RDP) is developed by Microsoft, which provides GUI to connect two devices over a network.

The user uses RDP client software to serve this purpose while other device must run RDP server software. This protocol is specifically designed for remote management and to access virtual PCs, applications, and terminal server.',



'Define Forward Secrecy.':'Forward Secrecy is a security measure that ensures the integrity of unique session key in event that long term key is compromised.',



'Explain the concept of IV in encryption.':'IV stands for the initial vector is an arbitrary number that is used to ensures that identical text encrypted to different ciphertexts. Encryption program uses this number only once per session.',



'Give some examples of a symmetric encryption algorithm.':'Following are some examples of symmetric encryption algorithm.

RCx
Blowfish
Rijndael (AES)
DES',



'What is the abbreviation of ECB and CBC?':'The full form of ECB is Electronic Codebook, and the full form of CBC is Cipher Block Chaining.',



'Explain a buffer overflow attack.':'Buffer overflow attack is an attack that takes advantage of a process that attempts to write more data to a fixed-length memory block.',



'Define Spyware.':'Spyware is a malware that aims to steal data about the organization or person. This malware can damage the organization’s computer system.',



'What is impersonation?':'It is a mechanism of assigning the user account to an unknown user.',



'What do you mean by SRM?':'SRM stands for Security Reference Monitor provides routines for computer drivers to grant access rights to object.',



'What is a computer virus?':'A virus is a malicious software that is executed without the user’s consent. Viruses can consume computer resources, such as CPU time and memory. Sometimes, the virus makes changes in other computer programs and insert its own code to harm the computer system.

A computer virus may be used to:

Access private data like user id and passwords
Display annoying messages to the user
Corrupt data in your computer
Log the user’s keystrokes',



'What do you mean by Authenticode?':'Authenticode is a technology that identifies the publisher of Authenticode sign software. It allows users to ensure that the software is genuine and not contain any malicious program.',



'Define CryptoAPI':'CryptoAPI is a collection of encryption APIs which allows developers to create a project on a secure network.',



'Explain steps to secure web server.':'Follow the following steps to secure your web server:

Update ownership of file.
Keep your webserver updated.
Disable extra modules in the webserver.
Delete default scripts.',



'What is Microsoft Baseline Security Analyzer?':'Microsoft Baseline Security Analyzer or MBSA is a graphical and command-line interface that provides a method to find missing security updates and misconfigurations.',



'What is Ethical hacking?':'Ethical hacking is a method to improve the security of a network. In this method, hackers fix vulnerabilities and weakness of computer or network. Ethical hackers use software tools to secure the system.',



'Explain social engineering and its attacks.':'Social engineering is the term used to convince people to reveal confidential information.

There are mainly three types of social engineering attacks: 1) Human-based, 2) Mobile-based, and 3) Computer-based.

Human-based attack: They may pretend like a genuine user who requests higher authority to reveal private and confidential information of the organization.
Computer-based attack: In this attack, attackers send fake emails to harm the computer. They ask people to forward such email.
Mobile-based attack: Attacker may send SMS to others and collect important information. If any user downloads a malicious app, then it can be misused to access authentication information.',



'What is IP and MAC Addresses?':'IP Address is the acronym for Internet Protocol address. An internet protocol address is used to uniquely identify a computer or device such as printers, storage disks on a computer network.

MAC Address is the acronym for Media Access Control address. MAC addresses are used to uniquely identify network interfaces for communication at the physical layer of the network.',



'What do you mean by a worm?':'A Worm is a type of malware which replicates from one computer to another.',



'Name some tools used for packet sniffing.':'Following are some tools used for packet sniffing.

Tcpdump
Kismet
Wireshark
NetworkMiner
Dsniff',



'Explain anti-virus sensor systems':'Antivirus is software tool that is used to identify, prevent, or remove the viruses present in the computer. They perform system checks and increase the security of the computer regularly.',



'List out the types of sniffing attacks.':'Various types of sniffing attacks are:

Protocol Sniffing
Web password sniffing
Application-level sniffing
TCP Session stealing
LAN Sniffing
ARP Sniffing',



'What is a distributed denial-of-service attack (DDoS)?':'It is an attack in which multiple computers attack website, server, or any network resource.',



'Explain the concept of session hijacking.':'TCP session hijacking is the misuse of a valid computer session. IP spoofing is the most common method of session hijacking. In this method, attackers use IP packets to insert a command between two nodes of the network.',



'List out various methods of session hijacking.':'Various methods of session hijacking are:

Using packet Sniffers
Cross-Site Scripting (XSS Attack)
IP Spoofing
Blind Attack',



'What are Hacking Tools?':'Hacking Tools are computer programs and scripts that help you find and exploit weaknesses in computer systems, web applications, servers, and networks. There are varieties of such tools available on the market. Some of them are open source, while others are a commercial solution.',



'Explain honeypot and its Types.':'Honeypot is a decoy computer system which records all the transactions, interactions, and actions with users.

Honeypot is classified into two categories: 1) Production honeypot and 2) Research honeypot.

Production honeypot: It is designed to capture real information for the administrator to access vulnerabilities. They are generally placed inside production networks to increase their security.
Research Honeypot: It is used by educational institutions and organizations for the sole purpose of researching the motives and tactics of the back-hat community for targeting different networks.',



'Name common encryption tools.':'Tools available for encryptions are as follows:

RSA
Twofish
AES
Triple DES',



'What is Backdoor?':'It is a malware type in which security mechanism is bypassed to access a system.',


'Is it right to send login credentials through email?':'It is not right to send login credentials through email because if you send someone userid and password in the mail, chances of email attacks are high.',


'Explain the 80/20 rule of networking?':'This rule is based on the percentage of network traffic, in which 80% of all network traffic should remain local while the rest of the traffic should be routed towards a permanent VPN.',



'Define WEP cracking.':'It is a method used for a security breach in wireless networks. There are two types of WEP cracking: 1) Active cracking and 2) Passive cracking.',



'What are various WEP cracking tools?':'Well known WEP cracking tools are:

Aircrack
WebDecrypt
Kismet
WEPCrack',



'What is a security auditing?':'Security auditing is an internal inspection of applications and operating systems for security flaws. An audit can also be done via line by line inspection of code.',



'Explain phishing.':'It is a technique used to obtain a username, password, and credit card details from other users.',



'What is Nano-scale encryption?':'Nano encryption is a research area which provides robust security to computers and prevents them from hacking.',



'Define Security Testing?':'Security Testing is defined as a type of Software Testing that ensures software systems and applications are free from any vulnerabilities, threats, risks that may cause a big loss.',



'Explain Security Scanning.':'Security scanning involves identifying network and system weaknesses and later provides solutions for reducing these risks. This scanning can be performed for both Manual as well as Automated scanning.',


'Name the available hacking tools.':'Following is a list of useful hacking tools.

Acunetix
WebInspect
Probably
Netsparker
Angry IP scanner:
Burp Suite
Savvius',



'What is the importance of penetration testing in an enterprise?':'Here are two common application of Penetration testing.

Financial sectors like stock trading exchanges, investment banking, want their data to be secured, and penetration testing is essential to ensure security.
In case if the software system is already hacked and the organization would like to determine whether any threats are still present in the system to avoid future hacks.',



'What are the disadvantages of penetration testing?':'Disadvantages of penetration testing are:

Penetration testing cannot find all vulnerabilities in the system.
There are limitations of time, budget, scope, skills of penetration testers.
Data loss and corruption
Down Time is high which increase costs',



'Explain security threat':'Security threat is defined as a risk which can steal confidential data and harm computer systems as well as organization.',



'What are physical threats?':'A physical threat is a potential cause of an incident that may result in loss or physical damage to the computer systems.',



'Give examples of non-physical threats':'Following are some examples of non-physical threat:

Loss of sensitive information
Loss or corruption of system data
Cyber security Breaches
Disrupt business operations that rely on computer systems
Illegal monitoring of activities on computer systems',



'What is Trojan virus?':'Trojan is a malware employed by hackers and cyber-thieves to gain access to any computer. Here attackers use social engineering techniques to execute the trojan on the system.',



'Define SQL Injection':'It is an attack that poisons malicious SQL statements to database. It helps you to take benefit of the design flaws in poorly designed web applications to exploit SQL statements to execute malicious SQL code. In many situations, an attacker can escalate SQL injection attack in order to perform other attack, i.e. denial-of-service attack.',



'List security vulnerabilities as per Open Web Application Security Project (OWASP).':'Security vulnerabilities as per open web application security project are as follows:

SQL Injection
Cross-site request forgery
Insecure cryptographic storage
Broken authentication and session management
Insufficient transport layer protection
Unvalidated redirects and forwards
Failure to restrict URL access',



'Define an access token.':'An access token is a credential which is used by the system to check whether the API should be granted to a particular object or not.',



'Explain ARP Poisoning':'ARP (Address Resolution Protocol) Poisoning is a type of cyber-attack which is used to convert IP address to physical addresses on a network device. The host sends an ARP broadcast on the network, and the recipient computer responds back with its physical address.

ARP poisoning is sending fake addresses to the switch so that it can associate the fake addresses with the IP address of a genuine computer on a network and hijack the traffic.',



'Name common types of non-physical threats.':'Following are various types of non-physical threats:

Trojans
Adware
Worms
Spyware
Denial of Service Attacks
Distributed Denial of Service Attacks
Virus
Key loggers
Unauthorized access to computer systems resources
Phishing',



'Explain the sequence of a TCP connection.':'The sequence of a TCP connection is SYN-SYN ACK-ACK.',



'Define hybrid attacks.':'Hybrid attack is a blend of dictionary method and brute force attack. This attack is used to crack passwords by making a change of a dictionary word with symbols and numbers.',



'What is Nmap?':'Nmap is a tool which is used for finding networks and in security auditing.',



'What is the use of EtterPeak tool?':'EtterPeak is a network analysis tool that is used for sniffing packets of network traffic.',



'What are the types of cyber-attacks?':'There are two types of cyberattacks: 1) Web-based attacks, 2) System based attacks.',



'List out web-based attacks':'Some web-based attacks are: 1) SQL Injection attacks, 2) Phishing, 3) Brute Force, 4) DNS Spoofing, 4) Denial of Service, and 5) Dictionary attacks.',



'Give examples of System-based attacks':'Examples of system-based attacks are:

Virus
Backdoors
Bots
Worm',



'List out the types of cyber attackers':'There are four types of cyber attackers. They are: 1) cybercriminals, 2) hacktivists, 3) insider threats, 4) state-sponsored attackers.',


'Define accidental threats':'They are threats that are accidently done by organization employees. In these threats, an employee unintentionally deletes any file or share confidential data with outsiders or a business partner going beyond the policy of the company.',


}