{
    "What is cyber crime?":"Any criminal activity that uses a computer either as instrumentality, target or a means for perpetuating further crimes comes within the ambit of cyber crime. The term “cyber-crime” is not defined under the Information Technology Act, 2000.In simple terms cyber crime would be “unlawful acts wherein the computer is either a tool or a target or both. It is also known as computer crime, e-crime and electronic crime.",
    "What are the various modes or manners of committing Cybercrime?":"There are various modes or methods by which cyber crime can be committed such as Unauthorized access to computer systems or networks / Hacking, Theft of information contained in electronic form,Email bombing,Data diddling,Salami attack,Denial of Service attack,Virus / worm attacks,Logic bombs, Internet time thefts",
    "What are the various types of cyber crimes?":"Cyber crimes can be classified into 3 major categories such as, Crime against government such as cyber terrorism, Crime against persons such as cyber pornography, cyber stalking, cyber defamation, Crime against property such as online gambling, intellectual property infringement, phishing, credit card frauds.",
    "What is an I.P address?":"The word I.P stands for Internet Protocol Address. It is a unique number consisting of four parts separated by dots, e.g. 151.164.1.6. Every machine that is on the Internet has a unique IP number, if a machine does not have an IP number; it is not really on the Internet. The IP address is just like any telephone number which identifies a particular computer on the Internet.",
    "What is an IP spoofing?":"A technique used to gain unauthorized access to computers, whereby the intruder sends messages to a computer with an IP address indicating that the message is coming from a trusted host. To engage in IP spoofing, a hacker must first use a variety of techniques to find an IP address of a trusted host and then modify the packet headers so that it appears that the packets are coming from that host.",
    "What do you mean by phishing?":"Phishing is the criminal and fraudulent act of attempting to acquire sensitive information such as usernames, password and credit card details by masquerading as a trustworthy entity or person in an electronic communication. Communications purporting to be from popular social web sites, auction sites, online payment processors or IT administrators are commonly used to lure the unsuspecting public. Phishing is typically carried out by e-mail or instant messaging and it often directs users to enter details at a fake website whose look and feel almost identical to the legitimate one.",
    "What is a domain name?":"Since it is not possible to remember each and every numerical value of an IP address, the system of domain names evolved. Domain names are the alphabetic names used to refer to computers on the Internet. A web site address, including a suffix such as .com, .org, .gov or .edu comprises a domain name. The suffix indicates what type of organization is hosting the site. The dominant purpose of the domain name is simply to provide an easy method for remembering another's electronic address.",
    "What are the laws concerning Cybercrimes in India?":"Cyber crime can involve criminal activities that are traditional in nature, such as theft, fraud, forgery, defamation and mischief, all of which are subject to the Indian Penal Code. The abuse of computers has also given birth to a gamut of new age crimes that are addressed by the Information Technology Act, 2000. The Act does not define “cyber crime”. However, any activities which basically offend human sensibilities would come within its ambit.",
    "How to report a Cyber crime?":"You need to provide the following possible information, along with an application letter addressing the head of cyber crime investigation cell when filing a complaint:Your name,Your mailing address,Your telephone number, Specific details on how the offence was committed, along with the names and addresses of suspects and any other relevant information necessary.In case of an emergency you can directly contact your local police station.",
    "Is Cyber harassment also a Cybercrime?":"Yes, it is a distinct Cybercrime. Various kinds of harassment can and does occur in cyberspace, or through the use of cyberspace. Harassment can be sexual, racial, religious, or other. Persons perpetuating such harassment are also guilty of Cybercrime.",
    "What is cyber defamation?":"This occurs when defamation takes place with the help of computers and / or the Internet. E.g. someone publishes defamatory matter about someone on a website or sends e-mails containing defamatory information.",
    "What is web-jacking?":"This term is derived from the term hi jacking. In these kinds of offences the hacker gains access and control over the web site of another. He may even change the information on the site. This may be done for fulfilling political objectives or for money. E.g. recently the site of MIT (Ministry of Information Technology) was hacked by the Pakistani hackers and some obscene matter was placed therein. Further the site of Bombay crime branch was also web jacked. Another case of web jacking is that of the “gold fish” case. In this case the site was hacked and the information pertaining to gold fish was changed.",
    "Is hacking a Cybercrime?":"Hacking is amongst the gravest Cybercrimes known till date. In simple terms it means an illegal intrusion into a computer system and/or network. Every act committed towards breaking into a computer and/or network is hacking. Some hackers hack for personal monetary gains, such as to stealing the credit card information, transferring money from various bank accounts to their own account followed by withdrawal of money. The offence is punishable under Section 66 of the IT Act,2000.",
    "What is bandwidth?":"It is the measure of how much information one can send through a connection. It is usually measured in bits-per-second.",
    "What is financial crime and what are the modes of committing such crime?":"Financial Crimes are defined as a crime against property, involving the unlawful conversion of the ownership of property (belonging to one person) to one”s own personal use and benefit.There are many different ways that these crimes can be committed, for instance by mail, fax, telephone and the Internet. By using social engineering techniques or sophisticated technical methods such as “phishing”, fraudsters are able to plunder bank accounts across the world. Victims range from individuals to institutions, corporations, governments, and entire economies.",
    "What is DNS SPOOFING?":"DNS Spoofing is a term used to describe the faking of host masks during the resolution of internet hosts names. To perform DNS spoofing a hacker attempts to intercept the communication and send fake host name mapping to the victims computer. This can be done using malicious web applets downloaded by the attacked user himself.",
    "What are Virus and other Malicious Programs and Webware?":"Virus-Malicious programs intend to cause harm to targeted systems and include virus, worms, Trojan horses, Logic bombs and hoaxes.A virus is a program that infects an executable file and after infecting it causes the file to function in an unusual way. It propagates itself by attaching to executable files like application programs and operating system. Running the executable file may make new copies of the virus. On the other hand there are programs that can copy itself called worms which don”t alter or delete any file but only multiply itself and send the copy to other computers from the victim”s computer.",
    "What is a Trojan Horse ?":"A destructive program that masquerades as a benign application. Unlike viruses,Trojan horses do not replicate themselves but they can be just as destructive. One of the most insidious types of Trojan horse is a program that claims to rid your computer of viruses but instead introduces viruses onto your computer. The term comes from the a Greek story of the Trojan War, in which the Greeks give a giant wooden horse to their foes, the Trojans, ostensibly as a peace offering. But after the Trojans drag the horse inside their city walls, Greek soldiers sneak out of the horse”s hollow belly and open the city gates, allowing their compatriots to pour in and capture Troy. Trojan horses are broken down in classification based on how they breach systems and the damage they cause.",
    "What is Cyberstalking?":"Cyberstalking, which is simply an extension of the physical form of stalking, is where the electronic mediums such as the Internet are used to pursue, harass or contact another in an unsolicited fashion. Most often, given the vast distances that the Internet spans, this behaviour will never manifest itself in the physical sense but this does not mean that the pursuit is any less distressing. There are a wide variety of means by which individuals may seek out and harass individuals even though they may not share the same geographic borders, and this may present a range of physical, emotional, and psychological consequences to the victim. In one such instance, Seema an employee with an embassy in New Delhi was harassed by a cyber stalker who used criminal blackmail and intimidation and demanded Rupees 1 lakh from her. This man threatened Seema that he would put her morphed pictures on obscene websites along with her phone number and address. The Protection from Harassment Act, 1997 of UK and Model Anti-stalking Code by the National Institute of Justice, USA for adoption by its states are examples of initiatives to combat the problem of cyber stalking.",
    "What is Cyber Terrorism?":"Cyber Terrorism denotes unlawful attacks and threats of attack against computers, network and information stored therein to intimidate or coerce a government or its people for propagating hidden political or unlawful social and religious motives. These attacks could result in violence against persons or property or cause public unrest. Few examples could be explosions, plane crashes and severe economic losses. Terrorists are known to use internet to prepare schemes, raise funds and spread cyber terrorism. For instance Ramzi Yousef who was a key person behind World Trade Centre attack had detailed schemes to destroy United States airliners encrypted files in his laptop computer.",
    "What is cybersecurity?":"Cybersecurity refers to the protection of hardware, software, and data from attackers. The primary purpose of cyber security is to protect against cyberattacks like accessing, changing, or destroying sensitive information."
}
